tiborsimon/embedded-tdd-headers/pic/pic18/pic18f86j16_tdd.h
#define PORTH_RH5                     522
#define CCP8                          523
#define PB3                           524
#define C2IND                         525
#define AN13                          526
#define C1INC                         527
#define PC1                           528
#define PORTH_RH6                     529
#define CCP7                          530
#define PORTH_PMRD                    531
#define AN14                          532
#define CCP6                          533
#define PB1                           534
#define PORTH_PMWR                    535
#define PORTH_RH7                     536
#define AN15                          537
#define PORTJ                         538
#define ALE                           539
#define PORTJ_RJ0                     540
#define OE                            541
#define PORTJ_RJ1                     542
#define WRL                           543
#define PORTJ_RJ2                     544
#define WRH                           545
#define PORTJ_RJ3                     546
#define BA0                           547
#define PORTJ_RJ4                     548
#define CE                            549
#define PORTJ_RJ5                     550
#define LB                            551
#define PORTJ_RJ6                     552
#define PORTJ_RJ7                     553
#define UB                            554
#define LATA                          555
#define LATA0                         556
#define LA0                           557
#define LATA1                         558
#define LA1                           559
#define LATA2                         560
#define LA2                           561
#define LATA3                         562
#define LA3                           563
#define LATA4                         564
#define LA4                           565
#define LATA5                         566
#define LA5                           567
#define LATA6                         568
#define LA6                           569
#define LATA7                         570
#define LA7                           571
#define LATB                          572
#define LB0                           573
#define LATB0                         574
#define LB1                           575
#define LATB1                         576
#define LB2                           577
#define LATB2                         578
#define LB3                           579
#define LATB3                         580
#define LB4                           581
#define LATB4                         582
#define LB5                           583
#define LATB5                         584
#define LB6                           585
#define LATB6                         586
#define LB7                           587
#define LATB7                         588
#define LATC                          589
#define LATC0                         590
#define LC0                           591
#define LATC1                         592
#define LC1                           593
#define LATC2                         594
#define LC2                           595
#define LATC3                         596
#define LC3                           597
#define LATC4                         598
#define LC4                           599
#define LATC5                         600
#define LC5                           601
#define LATC6                         602
#define LC6                           603
#define LATC7                         604
#define LC7                           605
#define LATD                          606
#define LATD0                         607
#define LD0                           608
#define LATD1                         609
#define LD1                           610
#define LATD2                         611
#define LD2                           612
#define LATD3                         613
#define LD3                           614
#define LATD4                         615
#define LD4                           616
#define LATD5                         617
#define LD5                           618
#define LATD6                         619
#define LD6                           620
#define LATD7                         621
#define LD7                           622
#define LATE                          623
#define LATE0                         624
#define LE0                           625
#define LATE1                         626
#define LE1                           627
#define LATE2                         628
#define LE2                           629
#define LATE3                         630
#define LE3                           631
#define LATE4                         632
#define LE4                           633
#define LATE5                         634
#define LE5                           635
#define LATE6                         636
#define LE6                           637
#define LATE7                         638
#define LE7                           639
#define LATF                          640
#define LATF1                         641
#define LF1                           642
#define LF2                           643
#define LATF2                         644
#define LF3                           645
#define LATF3                         646
#define LF4                           647
#define LATF4                         648
#define LF5                           649
#define LATF5                         650
#define LF6                           651
#define LATF6                         652
#define LF7                           653
#define LATF7                         654
#define LATG                          655
#define LATG0                         656
#define LG0                           657
#define LATG1                         658
#define LG1                           659
#define LATG2                         660
#define LG2                           661
#define LATG3                         662
#define LG3                           663
#define LATG4                         664
#define LG4                           665
#define LATH                          666
#define LH0                           667
#define LATH0                         668
#define LH1                           669
#define LATH1                         670
#define LH2                           671
#define LATH2                         672
#define LH3                           673
#define LATH3                         674
#define LH4                           675
#define LATH4                         676
#define LH5                           677
#define LATH5                         678
#define LH6                           679
#define LATH6                         680
#define LH7                           681
#define LATH7                         682
#define LATJ                          683
#define LATJ0                         684
#define LJ0                           685
#define LATJ1                         686
#define LJ1                           687
#define LATJ2                         688
#define LJ2                           689
#define LATJ3                         690
#define LJ3                           691
#define LATJ4                         692
#define LJ4                           693
#define LATJ5                         694
#define LJ5                           695
#define LATJ6                         696
#define LJ6                           697
#define LATJ7                         698
#define LJ7                           699
#define TRISA                         700
#define TRISA0                        701
#define TRISA_RA0                     702
#define TRISA1                        703
#define TRISA_RA1                     704
#define TRISA2                        705
#define TRISA_RA2                     706
#define TRISA3                        707
#define TRISA_RA3                     708
#define TRISA_RA4                     709
#define TRISA4                        710
#define TRISA_RA5                     711
#define TRISA5                        712
#define TRISA_RA6                     713
#define TRISA6                        714
#define TRISA_RA7                     715
#define TRISA7                        716
#define TRISB                         717
#define TRISB_RB0                     718
#define TRISB0                        719
#define TRISB_RB1                     720
#define TRISB1                        721
#define TRISB_RB2                     722
#define TRISB2                        723
#define TRISB_RB3                     724
#define TRISB3                        725
#define TRISB_RB4                     726
#define TRISB4                        727
#define TRISB_RB5                     728
#define TRISB5                        729
#define TRISB_RB6                     730
#define TRISB6                        731
#define TRISB_RB7                     732
#define TRISB7                        733
#define TRISC                         734
#define TRISC0                        735
#define TRISC_RC0                     736
#define TRISC1                        737
#define TRISC_RC1                     738
#define TRISC2                        739
#define TRISC_RC2                     740
#define TRISC3                        741
#define TRISC_RC3                     742
#define TRISC4                        743
#define TRISC_RC4                     744
#define TRISC5                        745
#define TRISC_RC5                     746
#define TRISC6                        747
#define TRISC_RC6                     748
#define TRISC7                        749
#define TRISC_RC7                     750
#define TRISD                         751
#define TRISD_RD0                     752
#define TRISD0                        753
#define TRISD_RD1                     754
#define TRISD1                        755
#define TRISD_RD2                     756
#define TRISD2                        757
#define TRISD_RD3                     758
#define TRISD3                        759
#define TRISD_RD4                     760
#define TRISD4                        761
#define TRISD_RD5                     762
#define TRISD5                        763
#define TRISD_RD6                     764
#define TRISD6                        765
#define TRISD_RD7                     766
#define TRISD7                        767
#define TRISE                         768
#define TRISE_RE0                     769
#define TRISE0                        770
#define TRISE1                        771
#define TRISE_RE1                     772
#define TRISE2                        773
#define TRISE_RE2                     774
#define TRISE_RE3                     775
#define TRISE3                        776
#define TRISE_RE4                     777
#define TRISE4                        778
#define TRISE_RE5                     779
#define TRISE5                        780
#define TRISE_RE6                     781
#define TRISE6                        782
#define TRISE_RE7                     783
#define TRISE7                        784
#define TRISF                         785
#define TRISF_RF1                     786
#define TRISF1                        787
#define TRISF2                        788
#define TRISF_RF2                     789
#define TRISF_RF3                     790
#define TRISF3                        791
#define TRISF_RF4                     792
#define TRISF4                        793
#define TRISF_RF5                     794
#define TRISF5                        795
#define TRISF_RF6                     796
#define TRISF6                        797
#define TRISF7                        798
#define TRISF_RF7                     799
#define TRISG                         800
#define TRISG0                        801
#define TRISG_RG0                     802
#define TRISG1                        803
#define TRISG_RG1                     804
#define TRISG2                        805
#define TRISG_RG2                     806
#define TRISG_RG3                     807
#define TRISG3                        808
#define TRISG4                        809
#define TRISG_RG4                     810
#define TRISH                         811
#define TRISH_RH0                     812
#define TRISH0                        813
#define TRISH_RH1                     814
#define TRISH1                        815
#define TRISH_RH2                     816
#define TRISH2                        817
#define TRISH_RH3                     818
#define TRISH3                        819
#define TRISH_RH4                     820
#define TRISH4                        821
#define TRISH_RH5                     822
#define TRISH5                        823
#define TRISH_RH6                     824
#define TRISH6                        825
#define TRISH_RH7                     826
#define TRISH7                        827
#define TRISJ                         828
#define TRISJ_RJ0                     829
#define TRISJ0                        830
#define TRISJ_RJ1                     831
#define TRISJ1                        832
#define TRISJ_RJ2                     833
#define TRISJ2                        834
#define TRISJ_RJ3                     835
#define TRISJ3                        836
#define TRISJ_RJ4                     837
#define TRISJ4                        838
#define TRISJ_RJ5                     839
#define TRISJ5                        840
#define TRISJ_RJ6                     841
#define TRISJ6                        842
#define TRISJ_RJ7                     843
#define TRISJ7                        844
#define OSCTUNE                       845
#define TUN0                          846
#define TUN1                          847
#define TUN2                          848
#define TUN3                          849
#define TUN4                          850
#define TUN5                          851
#define PLLEN                         852
#define INTSRC                        853
#define RCSTA2                        854
#define RCD82                         855
#define RX9D2                         856
#define RCSTA2_RCD8                   857
#define RCSTA2_RX9D                   858
#define RCSTA2_OERR                   859
#define OERR2                         860
#define FERR2                         861
#define RCSTA2_FERR                   862
#define ADDEN2                        863
#define RCSTA2_ADDEN                  864
#define RCSTA2_CREN                   865
#define CREN2                         866
#define SREN2                         867
#define RCSTA2_SREN                   868
#define RC92                          869
#define RCSTA2_nRC8                   870
#define RC8_92                        871
#define RCSTA2_RX9                    872
#define RCSTA2_NOT_RC8                873
#define RCSTA2_RC9                    874
#define RCSTA2_RC8_9                  875
#define RX92                          876
#define RCSTA2_SPEN                   877
#define SPEN2                         878
#define PIE1                          879
#define TMR1IE                        880
#define TMR2IE                        881
#define CCP1IE                        882
#define SSP1IE                        883
#define SSPIE                         884
#define TXIE                          885
#define TX1IE                         886
#define RC1IE                         887
#define RCIE                          888
#define ADIE                          889
#define PSPIE                         890
#define PMPIE                         891
#define PIR1                          892
#define TMR1IF                        893
#define TMR2IF                        894
#define CCP1IF                        895
#define SSPIF                         896
#define SSP1IF                        897
#define TXIF                          898
#define TX1IF                         899
#define RCIF                          900
#define RC1IF                         901
#define ADIF                          902
#define PSPIF                         903
#define PMPIF                         904
#define IPR1                          905
#define TMR1IP                        906
#define TMR2IP                        907
#define CCP1IP                        908
#define SSPIP                         909
#define SSP1IP                        910
#define TX1IP                         911
#define TXIP                          912
#define RCIP                          913
#define RC1IP                         914
#define ADIP                          915
#define PMPIP                         916
#define PSPIP                         917
#define PIE2                          918
#define CCP2IE                        919
#define TMR3IE                        920
#define LVDIE                         921
#define BCL1IE                        922
#define BCLIE                         923
#define CM1IE                         924
#define CMIE                          925
#define CM2IE                         926
#define OSCFIE                        927
#define PIR2                          928
#define CCP2IF                        929
#define TMR3IF                        930
#define LVDIF                         931
#define BCL1IF                        932
#define BCLIF                         933
#define CM1IF                         934
#define CMIF                          935
#define CM2IF                         936
#define OSCFIF                        937
#define IPR2                          938
#define CCP2IP                        939
#define TMR3IP                        940
#define LVDIP                         941
#define BCLIP                         942
#define BCL1IP                        943
#define CM1IP                         944
#define CM2IP                         945
#define CMIP                          946
#define OSCFIP                        947
#define PIE3                          948
#define CCP3IE                        949
#define RXB0IE                        950
#define RXBNIE                        951
#define RXB1IE                        952
#define CCP4IE                        953
#define TXB0IE                        954
#define CCP5IE                        955
#define TXB1IE                        956
#define TMR4IE                        957
#define TXB2IE                        958
#define TXBNIE                        959
#define TX2IE                         960
#define RC2IE                         961
#define BCL2IE                        962
#define SSP2IE                        963
#define PIR3                          964
#define CCP3IF                        965
#define RXBNIF                        966
#define CCP4IF                        967
#define CCP5IF                        968
#define TMR4IF                        969
#define TXBNIF                        970
#define TX2IF                         971
#define RC2IF                         972
#define BCL2IF                        973
#define SSP2IF                        974
#define IPR3                          975
#define CCP3IP                        976
#define CCP4IP                        977
#define RXBNIP                        978
#define CCP5IP                        979
#define TMR4IP                        980
#define TX2IP                         981
#define TXBNIP                        982
#define RC2IP                         983
#define BCL2IP                        984
#define SSP2IP                        985
#define EECON1                        986
#define WR                            987
#define WREN                          988
#define WRERR                         989
#define FREE                          990
#define WPROG                         991
#define TXSTA2                        992
#define TXSTA2_TXD8                   993
#define TX9D2                         994
#define TXSTA2_TX9D                   995
#define TXD82                         996
#define TRMT2                         997
#define TXSTA2_TRMT                   998
#define BRGH2                         999
#define TXSTA2_BRGH                   1000
#define SENDB2                        1001
#define TXSTA2_SENDB                  1002
#define TXSTA2_SYNC                   1003
#define SYNC2                         1004
#define TXEN2                         1005
#define TXSTA2_TXEN                   1006
#define TX8_92                        1007
#define TX92                          1008
#define TXSTA2_TX9                    1009
#define TXSTA2_nTX8                   1010
#define TXSTA2_NOT_TX8                1011
#define TXSTA2_TX8_9                  1012
#define TXSTA2_CSRC                   1013
#define CSRC2                         1014
#define RCSTA1                        1015
#define RCSTA1_RX9D                   1016
#define RX9D1                         1017
#define RCSTA1_RCD8                   1018
#define RCSTA1_OERR                   1019
#define OERR1                         1020
#define RCSTA1_FERR                   1021
#define FERR1                         1022
#define RCSTA1_ADDEN                  1023
#define ADDEN1                        1024
#define RCSTA1_CREN                   1025
#define CREN1                         1026
#define SRENA                         1027
#define SREN1                         1028
#define RCSTA1_SREN                   1029
#define RCSTA1_NOT_RC8                1030
#define RCSTA1_RC9                    1031
#define RCSTA1_nRC8                   1032
#define RCSTA1_RC8_9                  1033
#define RCSTA1_RX9                    1034
#define RX91                          1035
#define RCSTA1_SPEN                   1036
#define SPEN1                         1037
#define TXSTA1                        1038
#define TX9D1                         1039
#define TXSTA1_TX9D                   1040
#define TXSTA1_TXD8                   1041
#define TRMT1                         1042
#define TXSTA1_TRMT                   1043
#define BRGH1                         1044
#define TXSTA1_BRGH                   1045
#define TXSTA1_SENDB                  1046
#define SENDB1                        1047
#define TXSTA1_SYNC                   1048
#define SYNC1                         1049
#define TXEN1                         1050
#define TXSTA1_TXEN                   1051
#define TX91                          1052
#define TXSTA1_NOT_TX8                1053
#define TXSTA1_TX8_9                  1054
#define TXSTA1_TX9                    1055
#define TXSTA1_nTX8                   1056
#define TXSTA1_CSRC                   1057
#define CSRC1                         1058
#define ECCP3CON                      1059
#define CCP3M                         1060
#define CCP3M0                        1061
#define CCP3M1                        1062
#define CCP3M2                        1063
#define CCP3M3                        1064
#define CCP3Y                         1065
#define DC3B                          1066
#define DC3B0                         1067
#define DC3B1                         1068
#define CCP3X                         1069
#define P3M                           1070
#define P3M0                          1071
#define P3M1                          1072
#define ECCP3DEL                      1073
#define ECCP3DEL_PDC0                 1074
#define P3DC0                         1075
#define ECCP3DEL_PDC                  1076
#define ECCP3DEL_PDC1                 1077
#define P3DC1                         1078
#define ECCP3DEL_PDC2                 1079
#define P3DC2                         1080
#define ECCP3DEL_PDC3                 1081
#define P3DC3                         1082
#define ECCP3DEL_PDC4                 1083
#define P3DC4                         1084
#define ECCP3DEL_PDC5                 1085
#define P3DC5                         1086
#define ECCP3DEL_PDC6                 1087
#define P3DC6                         1088
#define P3RSEN                        1089
#define ECCP3DEL_PRSEN                1090
